/* ########################################## */
/* ###|By: Melnik Atrhur <molluk@mail.ru>|### */
/* ###|                                  |### */
/* ###|   Created: 2020-04-18 15:13:14   |### */
/* ########################################## */

#include <iostream>
#include <string>
#include <cstdlib>

using namespace std;

#include "funct.h"
#include "the_functions.cpp"

const string book_name[] = {"авиаль ", "ажушак ", "актеон ", "амеджи ", "амейоз ", "амслен ", "амхара ", "аппель ", "атриум ", "бализм ", "барзак ", "биласт ", "биссус ", "богема ", "брыкун ", "буфера ", "вноска ", "выкрут ", "газоем ", "ганзас ", "гезимс ", "гипнос ", "глобин ", "горлач ", "грелка ", "гуанин ", "джембе ", "диплом ", "доступ ", "жасмон ", "жердяй ", "зимаза ", "зление ", "зоолог ", "зрение ", "кампеш ", "кантик ", "каффар ", "кванза ", "клешня ", "клякса ", "ковдит ", "козлик ", "конюга ", "косник ", "линкор ", "льянос ", "ляйляк ", "лёгкая ", "мирзаи "};
const string book_name_last[] = {"мироед", "мордка", "мухояр", "нагель", "наемка", "накрой", "нелады", "неплат", "нетбук", "нефрас", "ниобит", "ньюгет", "облава", "откорм", "парина", "пассаж", "пассив", "первая", "пиоцин", "плероз", "плетка", "полмая", "прасол", "припыл", "регаль", "ригель", "седиль", "сесото", "сиеста", "сиудад", "склока", "скопин", "слёток", "сюркуп", "терпёж", "тилака", "тризна", "фирхен", "фразер", "хоруми", "хромий", "хромис", "худшая", "ценное", "чекань", "чихота", "шерсть", "эксаом", "энофил", "эрланг"};
const string author_man_name[] = {"Григорий ", "Модест ", "Николай ", "Ипатий ", "Прохор ", "Аким ", "Степан ", "Ираклий ", "Демьян ", "Севастьян ", "Мефодий ", "Аристарх ", "Мстислав ", "Ипполит ", "Андрон ", "Вячеслав ", "Данила ", "Яков ", "Борислав ", "Глеб ", "Аркадий "};
const string author_man_last_name[] = {"Битнер ", "Носачёв ", "Поливанов ", "Касимов ", "Воронцов ", "Кинжаев ", "Кудрявцев ", "Килин ", "Вергунов ", "Щепкин ", "Тарновецкий ", "Чмыхов ", "Курташкин ", "Мирохин ", "Новокшонов ", "Явлюхин ", "Посохов ", "Козлитин ", "Дутов ", "Капитанчук ", "Шангин ", "Вахров ", "Гуковский ", "Баринов ", "Фернандес "};
const string author_woman_name[] = {"Зинаида ", "Юлия ", "Валерия ", "Эвелина ", "Валентина ", "Марфа ", "Наталия ",  "Дарья ", "Агния ", "Римма ", "Агафья ", "Лилия ", "Стела ", "Лада ", "Альбина ", "Любовь ", "Аза ", "Инга ", "Полина ", "Ника ", "Евгения ", "Оксана ", "Рената ", "Анфиса ", "Мария "};
const string author_woman_last_name[] = {"Сагадиева ", "Юркова ", "Шимякина ", "Каменева ", "Малахова ", "Колонтаева ", "Сарнычева ", "Усоева ", "Крайнева ", "Новохацкая ", "Клецка ", "Шаповалова ", "Вахрова ", "Цулукидзе ", "Бородина ", "Анишина ", "Нустрова ", "Циолковская ", "Висенина ", "Груздева ", "Муравей ", "Разбойникова ", "Якупова ", "Натарова ", "Пелёвина "};
const string publishing_house[] = {"Эксмо, г.Москва", "АСТ, г.Москва", "Просвещение, г.Санкт-Петербург", "Азбука-Аттикус (издательская группа), г.Санкт-Петербург", "Росмэн, г.Москва", "Эгмонт Россия Лтд, г.Москва	", "Дрофа, г.Москва", "Издательские решения, г.Екатеринбург", "С-Трейд, г.Москва", "Центрполиграф, г.Москва", "Фламинго, г.Москва", "Вече, г.Москва", "Перо, г.Москва", "Ленанд, г.Москва", "Манн, Иванов и Фербер, г.Москва", "Издательство «Лань», г.Санкт-Петербург", "Феникс, г.Ростов-на-Дону", "АзовПечать, г.Азов", "Российский университет дружбы народов, г.Москва", "Экзамен, г.Москва", "Рубцовский индустриальный институт филиал АлтГТУ, г.Рубцовск", "Мозаика-Синтез, г.Москва", "Клевер-Медиа-Групп, Москва", "Южно-Уральский государственный университет, г.Челябинск", "Проспект, г.Москва", "Белгородский государственный технологический университет им. В.Г. Шухова, г.Белгород", "Питер, г.Санкт-Петербург", "Вентана-Граф, г.Москва", "Спутник+, г.Москва", "ВАКО, г.Москва"};
const string genre[] = {"Боевик", "Детские книги", "История", "Детективы", "Книги для подростков", "Kлассика", "Путешествия", "Ужасы", "Романтика", "Фантастика", "Манга", "Комиксы", "Приключения", "Преступность"};

int     main()
{
    int num;

    setlocale(LC_ALL, "Russian");
    srand(time(NULL));

    cout << "Enter the number of books: ";
    cin >> num;

    Book_libr book_list[num];

    for(int i = 0; i < num; i++)
    {
        book_list[i].name = book_name[(0 + rand() % 49)] + book_name_last[(0 + rand() % 49)];
        if((1 + rand() % 2) == 1)
            book_list[i].author = author_man_last_name[(0 + rand() % 24)] + author_man_name[(0 + rand() % 24)];
        else
            book_list[i].author = author_woman_last_name[(0 + rand() % 24)] + author_woman_name[(0 + rand() % 24)];
        book_list[i].publishing_house = publishing_house[(0 + rand() % 30)];
        book_list[i].genre = genre[(0 + rand() % 13)];
    }

    for(int i = 0; i < num; i++)
    {
        cout << i << ") ";
        cout << "Book name: " << book_list[i].name << "; ";
        cout << "Author: " << book_list[i].author << "; ";
        cout << "Publishing_house: " << book_list[i].publishing_house << "; ";
        cout << "Genre: " << book_list[i].genre << ";" << endl;
    }
    
    //cout_book(book_list, num);

    //delete [] book_list;

    return 0;
}
