/* ########################################## */
/* ###|By: Melnik Atrhur <molluk@mail.ru>|### */
/* ###|                                  |### */
/* ###|   Created: 2020-04-18 16:03:24   |### */
/* ########################################## */

#include <iostream>

#include "funct.h"

using namespace std;

int     random_name(int random)
{
    string book_name[] = {"авиаль ", "ажушак ", "актеон ", "амеджи ", "амейоз ", "амслен ", "амхара ", "аппель ", "атриум ", "бализм ", "барзак ", "биласт ", "биссус ", "богема ", "брыкун ", "буфера ", "вноска ", "выкрут ", "газоем ", "ганзас ", "гезимс ", "гипнос ", "глобин ", "горлач ", "грелка ", "гуанин ", "джембе ", "диплом ", "доступ ", "жасмон ", "жердяй ", "зимаза ", "зление ", "зоолог ", "зрение ", "кампеш ", "кантик ", "каффар ", "кванза ", "клешня ", "клякса ", "ковдит ", "козлик ", "конюга ", "косник ", "линкор ", "льянос ", "ляйляк ", "лёгкая ", "мирзаи "};
    string book_name_last[] = {"мироед", "мордка", "мухояр", "нагель", "наемка", "накрой", "нелады", "неплат", "нетбук", "нефрас", "ниобит", "ньюгет", "облава", "откорм", "парина", "пассаж", "пассив", "первая", "пиоцин", "плероз", "плетка", "полмая", "прасол", "припыл", "регаль", "ригель", "седиль", "сесото", "сиеста", "сиудад", "склока", "скопин", "слёток", "сюркуп", "терпёж", "тилака", "тризна", "фирхен", "фразер", "хоруми", "хромий", "хромис", "худшая", "ценное", "чекань", "чихота", "шерсть", "эксаом", "энофил", "эрланг"};
    string name[] = {book_name[random] + book_name_last[random]};
    return name;
}

int     random_author(int random)
{

}

int     random_publishing_house(int random)
{

}

int     random_genre(int random)
{

}
