/* ########################################## */
/* ###|By: Melnik Atrhur <molluk@mail.ru>|### */
/* ###|                                  |### */
/* ###|   Created: 2020-04-18 16:03:24   |### */
/* ########################################## */

#include <iostream>
#include <string>
#include "funct.h"

using namespace std;

char    random_book_name(int random)
{
    string book_name[] = {"авиаль ", "ажушак ", "актеон ", "амеджи ", "амейоз ", "амслен ", "амхара ", "аппель ", "атриум ", "бализм ", "барзак ", "биласт ", "биссус ", "богема ", "брыкун ", "буфера ", "вноска ", "выкрут ", "газоем ", "ганзас ", "гезимс ", "гипнос ", "глобин ", "горлач ", "грелка ", "гуанин ", "джембе ", "диплом ", "доступ ", "жасмон ", "жердяй ", "зимаза ", "зление ", "зоолог ", "зрение ", "кампеш ", "кантик ", "каффар ", "кванза ", "клешня ", "клякса ", "ковдит ", "козлик ", "конюга ", "косник ", "линкор ", "льянос ", "ляйляк ", "лёгкая ", "мирзаи "};
    string book_name_last[] = {"мироед", "мордка", "мухояр", "нагель", "наемка", "накрой", "нелады", "неплат", "нетбук", "нефрас", "ниобит", "ньюгет", "облава", "откорм", "парина", "пассаж", "пассив", "первая", "пиоцин", "плероз", "плетка", "полмая", "прасол", "припыл", "регаль", "ригель", "седиль", "сесото", "сиеста", "сиудад", "склока", "скопин", "слёток", "сюркуп", "терпёж", "тилака", "тризна", "фирхен", "фразер", "хоруми", "хромий", "хромис", "худшая", "ценное", "чекань", "чихота", "шерсть", "эксаом", "энофил", "эрланг"};
    string book_full_name = {book_name[random] + book_name_last[random]};
    return book_full_name;
}

char     random_author(int random, int random_gender)
{
    if (random_gender == 1)
    {
        string author_man_name[] = {"Григорий ", "Модест ", "Николай ", "Ипатий ", "Прохор ", "Аким ", "Степан ", "Ираклий ", "Демьян ", "Севастьян ", "Мефодий ", "Аристарх ", "Мстислав ", "Ипполит ", "Андрон ", "Вячеслав ", "Данила ", "Яков ", "Борислав ", "Глеб ", "Аркадий "};
        string author_man_last_name[] = {"Битнер ", "Носачёв ", "Поливанов ", "Касимов ", "Воронцов ", "Кинжаев ", "Кудрявцев ", "Килин ", "Вергунов ", "Щепкин ", "Тарновецкий ", "Чмыхов ", "Курташкин ", "Мирохин ", "Новокшонов ", "Явлюхин ", "Посохов ", "Козлитин ", "Дутов ", "Капитанчук ", "Шангин ", "Вахров ", "Гуковский ", "Баринов ", "Фернандес "};
        string full_author_man = author_man_last_name[random] + author_man_name[random];
        return full_author_man;
    }
    else
    {
        string author_woman_name[] = {"Зинаида ", "Юлия ", "Валерия ", "Эвелина ", "Валентина ", "Марфа ", "Наталия ",  "Дарья ", "Агния ", "Римма ", "Агафья ", "Лилия ", "Стела ", "Лада ", "Альбина ", "Любовь ", "Аза ", "Инга ", "Полина ", "Ника ", "Евгения ", "Оксана ", "Рената ", "Анфиса ", "Мария "};
        string author_woman_last_name[] = {"Сагадиева ", "Юркова ", "Шимякина ", "Каменева ", "Малахова ", "Колонтаева ", "Сарнычева ", "Усоева ", "Крайнева ", "Новохацкая ", "Клецка ", "Шаповалова ", "Вахрова ", "Цулукидзе ", "Бородина ", "Анишина ", "Нустрова ", "Циолковская ", "Висенина ", "Груздева ", "Муравей ", "Разбойникова ", "Якупова ", "Натарова ", "Пелёвина "};
        string full_author_woman = author_woman_last_name[random] + author_woman_name[random];
        return full_author_woman;
    }
}

char     random_publishing_house(int random)
{
    string publishing_house[] = {"Эксмо, г.Москва", "АСТ, г.Москва", "Просвещение, г.Санкт-Петербург", "Азбука-Аттикус (издательская группа), г.Санкт-Петербург", "Росмэн, г.Москва", "Эгмонт Россия Лтд, г.Москва	", "Дрофа, г.Москва", "Издательские решения, г.Екатеринбург", "С-Трейд, г.Москва", "Центрполиграф, г.Москва", "Фламинго, г.Москва", "Вече, г.Москва", "Перо, г.Москва", "Ленанд, г.Москва", "Манн, Иванов и Фербер, г.Москва", "Издательство «Лань», г.Санкт-Петербург", "Феникс, г.Ростов-на-Дону", "АзовПечать, г.Азов", "Российский университет дружбы народов, г.Москва", "Экзамен, г.Москва", "Рубцовский индустриальный институт филиал АлтГТУ, г.Рубцовск", "Мозаика-Синтез, г.Москва", "Клевер-Медиа-Групп, Москва", "Южно-Уральский государственный университет, г.Челябинск", "Проспект, г.Москва", "Белгородский государственный технологический университет им. В.Г. Шухова, г.Белгород", "Питер, г.Санкт-Петербург", "Вентана-Граф, г.Москва", "Спутник+, г.Москва", "ВАКО, г.Москва"};
    return publishing_house[random];
}

char     random_genre(int random)
{
    string genre[] = {"Античная литература", "Биографии и мемуары", "Военное дело", "Готовка и кулинария", "Детские книги", "Дом и хозяйство", "Домашние питомцы", "Драматургия", "Естественные науки", "Животные и сельское хозяйство", "Зарубежная литература", "История", "Детективы", "Книги для подростков", "Kлассика", "Путешествия", "Ужасы", "Романтика", "Фантастика", "Манга", "Комиксы", "Приключения", "Преступность"};
    return genre[random];
}
